app/controllers/movies_controller.rb

  def index
    if params[:sort_by]
      @sort_by = params[:sort_by]
      session[:sort_by] = params[:sort_by]
		elsif session[:sort_by]
			params[:sort_by] = session[:sort_by]
			flash.keep
			redirect_to movies_path(params) and return
		else
		  @sort_by = nil
		end
		@hilite = sort_by = session[:sort_by]
		@all_ratings = Movie.all_ratings
		if params[:ratings]
		  @ratings = params[:ratings]
			session[:ratings] = params[:ratings]
		elsif session[:ratings]
			params[:ratings] = session[:ratings]
			flash.keep
			redirect_to movies_path(params) and return
		end
		@checked_ratings = (session[:ratings].keys if session.key?(:ratings)) || @all_ratings
    @movies = Movie.order(sort_by).where(rating: @checked_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date